Tekla.Structures.Model.Operations.GuidConversion
Conversion of old TS GUIDs to current GUIDs.
GUIDs are changed in TS save as operation, this class can be used to convert old GUIDs to current GUIDs.
To recognize the need for GUID conversion, application needs to save project GUID and compare to the current project GUID.
Note: With big models the instance uses a lot of memory.

Tekla.Structures.Model.Operations.GuidConversion.GuidMapFile
The GUID map file

Tekla.Structures.Model.Operations.GuidConversion.oldGuidNewGuid
The old GUID new GUID mapping

Tekla.Structures.Model.Operations.GuidConversion.newGuidOldGuid
The new GUID old GUID mapping. Only available when loading the file.

Tekla.Structures.Model.Operations.GuidConversion.#ctor
Initializes a new instance of the Tekla.Structures.Model.Operations.GuidConversion class.

Tekla.Structures.Model.Operations.GuidConversion.GetGuidMapping
Gets the GUID mapping.
Returns: The GUID mapping

Tekla.Structures.Model.Operations.GuidConversion.GetNewGuid(System.Guid)
Gets the new GUID.
oldGuid: The old GUID.
Returns: The current GUID

Tekla.Structures.Model.Operations.GuidConversion.LoadGuidMapping(System.String)
Loads the GUID mapping.
modelFolder: The model folder.

Tekla.Structures.Model.Operations.GuidConversion.AddToGuidMap(System.Guid,System.Guid)
Adds to GUID map.
oldGuid: The old GUID.
newGuid: The new GUID.

Tekla.Structures.Model.Operations.GuidConversion.IsGuid(System.String)
Checks if the given string is a guid string.
str: The input string.
Returns: True if guid, otherwise false.